Revit 2024 API
DirectContext3DHandleSettings.IsEqual Method
 Check if the contents of two instances of settings are equal.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsEqual(
	DirectContext3DHandleSettings other
)
Visual Basic
Public Function IsEqual ( _
	other As DirectContext3DHandleSettings _
) As Boolean
Visual C++
public:
bool IsEqual(
	DirectContext3DHandleSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
 The settings to be compared.
Return Value
 True for equal, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace